Repository: FisherRone/AutoPlan
Catalog: AutoPlan/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# 确定删除模型「%@」吗？
source: Are you sure you want to delete model 「%@」?
zh_hans: 确定删除模型「%@」吗？
zh_hant: 確定刪除模型「%@」嗎？

# 管理...
source: Manage…
zh_hans: 管理...
zh_hant: 管理...

# 继续编辑
source: Continue Editing
zh_hans: 继续编辑
zh_hant: 繼續編輯

# 编辑...
source: Edit…
zh_hans: 编辑...
zh_hant: 編輯...

# 网络连接错误: %@
source: Network error: %@
zh_hans: 网络连接错误: %@
zh_hant: 網路連線錯誤: %@

# 自定义 API 地址的 LLM 服务商
source: LLM provider with custom API URL
zh_hans: 自定义 API 地址的 LLM 服务商
zh_hant: 自訂 API 位址的 LLM 服務商

# 自定义提示词
source: Custom Prompt
zh_hans: 自定义提示词
zh_hant: 自訂提示詞

# 自定义提示词读取失败，已回退到默认
source: Failed to read custom prompt, falling back to default.
zh_hans: 自定义提示词读取失败，已回退到默认
zh_hant: 自訂提示詞讀取失敗，已回退到預設

# 获取 API Key
source: Get an API Key…
zh_hans: 获取 API Key
zh_hant: 取得 API Key

# 试一试：
source: Try it：
zh_hans: 试一试：
zh_hant: 試一試：

# 请先在 App 设置中选择一个模型
source: Please select a model in app settings.
zh_hans: 请先在 App 设置中选择一个模型
zh_hant: 請先在 App 設定中選擇一個模型

# 请求过于频繁，请稍后再试
source: Too many requests, please try again later.
zh_hans: 请求过于频繁，请稍后再试
zh_hant: 請求過於頻繁，請稍後再試

# 读取日历数据失败: %@
source: Failed to read calendar data: %@
zh_hans: 读取日历数据失败: %@
zh_hant: 讀取行事曆資料失敗: %@

# 输入 API Key
source: Enter API Key…
zh_hans: 输入 API Key
zh_hant: 輸入 API Key

# 选择图标
source: Choose Icon
zh_hans: 选择图标
zh_hant: 選擇圖示

# 通用
source: General
zh_hans: 通用
zh_hant: 一般

# 配置保存失败
source: Failed to save configuration.
zh_hans: 配置保存失败
zh_hant: 配置儲存失敗

# 重命名模型
source: Rename Model
zh_hans: 重命名模型
zh_hant: 重新命名模型

# 隐藏
source: Hide
zh_hans: 隐藏
zh_hant: 隱藏

# 需要确认
source: Require Confirmation
zh_hans: 需要确认
zh_hant: 需要確認

# 高级
source: Advanced
zh_hans: 高级
zh_hant: 進階
